{
  "global": {
    "title": "Wichteln",
    "language": "Sprache",
    "themeswitch": "Dunkle Ansicht",
    "versionnumber": "v1.0.1"
  },
  "navigation": {
    "home": "Start",
    "create-group": "Gruppe erstellen",
    "github": "Github",
    "login": "Anmelden",
    "register": "Registrieren",
    "help": "Hilfe"
  },
  "home": {
    "formtitle": "Partner ziehen",
    "input": "Eingabe",
    "result": "Ergebnis",
    "group": "Gruppe",
    "name": "Name",
    "key": "Schlüssel",
    "draw": "Weiter",
    "back": "Zurück",
    "create-group": "Gruppe erstellen",
    "invalid-credentials": "Ungültige Eingabe",
    "message": "Dein Partner ist:",
    "accept": "Akzeptieren",
    "autoaccept": "Nach {n} Minuten wird der Partner automatisch akzeptiert.",
    "reroll": "Erneut ziehen",
    "reroll-tooltip": "Du kannst noch {n} mal neu ziehen. Achtung du kannst den selben Partner erneut ziehen.",
    "validation-groupnamerequired": "Gruppenname muss befüllt sein",
    "validation-groupnamelength": "Gruppenname darf maximal {max} Zeichen lang sein",
    "validation-membernamerequired": "Mitgliedname muss befüllt sein",
    "validation-membernamelength": "Mitgliedname darf maximal {max} Zeichen lang sein",
    "validation-keyrequired": "Schlüssel muss befüllt sein",
    "validationerror": "Bitte Angaben richtig befüllen"
  },
  "new-group": {
    "formtitle": "Neue Gruppe erstellen",
    "name": "Gruppenname",
    "membercount": "Mitgliederzahl",
    "email": "Zugangsdaten per E-Mail versenden",
    "rerolls": "Neuwahl zulassen",
    "rerolls-slider": "Anzahl an Neuwahlen",
    "back": "Abbrechen | Zurück | Home",
    "next": "Weiter | Erstellen | Fertig",
    "member-name": "Name",
    "member-email": "E-Mail",
    "member-key": "Schlüssel",
    "member-number": "Nummer",
    "group": "Gruppe",
    "member": "Mitglieder",
    "result": "Ergebnis",
    "error-groupname-exists": "Gruppenname existiert bereits",
    "final-title": "Gruppe: {name}",
    "validation-groupnamerequired": "Gruppenname muss angegeben werden",
    "validation-groupnamelength": "Gruppenname darf maximal {max} Zeichen lang sein",
    "validation-membercountbounds": "Mitgliederanzahl muss zwischen {min} und {max} liegen",
    "validation-rerollsbounds": "Anzahl an Neuwahlen muss zwischen {min} und {max} liegen",
    "validation-memberrequired": "Mitgliedername muss angegeben werden",
    "validation-memberlength": "Mitgliedername darf maximal {max} Zeichen lang sein",
    "validationerror": "Bitte Angaben richtig befüllen"
  },
  "help": {
    "formtitle": "Hilfe",
    "home": "Zurück",
    "firststeps": "Erste Schritte",
    "firststeps-content": "Herzlich Willkommen auf der Seite zum organisieren einer Wichtelziehung. Das Erstellen und Durchführen ist ganz einfach. Als erstes muss eine neue Gruppe mit einem Namen erstellt werden. In dieser werden dann die Mitglieder hinzugefügt und am Ende wird jedem Mitglied einen Schlüssel zugewiesen. Mit dem Gruppennamen, dem Mitgliedsnamen und dazugehörigen Schlüssel kann jedes Mitglied dann selbstständig einen Partner aus der Gruppe ziehen. Das wars.",
    "newgroup": "Gruppe erstellen",
    "newgroup-content": "Über die Schaltfläche 'Gruppe erstellen' kann eine neue Gruppe erstellt werden. Bei dieser muss dann zuerst ein Gruppenname und die Anzahl der Mitglieder eingegeben werden. Optional kann noch den Mitgliedern die Möglichkeit gegeben werden, dass diese nach einer Partnerzuweisung einen neuen Partner ziehen können, wenn der erstgezogene Partner nicht gefällt. Diese Option kann per Aktivierung der 'Neuwahl zulassen' Box aktiviert werden. Mit der Zahl in 'Anzahl an Neuwahlen' kann die Anzahl festgelegt werden wie oft ein Mitglied erneut ziehen kann. (Achtung es kann auch der aktuell gezogene Partner erneut gezogen werden). Durch einen Klick auf 'Weiter' wird man dann gebeten den Namen oder ein Pseudonym für jedes Mitglied anzugeben. Es darf kein Name/Pseudonym mehrmals auftreten in einer Gruppe. Durch einen Klick auf 'Erstellen' wird die Gruppe dann erstellt und man erhält alle Zugangsdaten. Oben ist dann den Gruppenname zu finden und darunter eine Liste der Mitglieder und zu jedem Miglied den Namen und den Schlüssel (Ansehbar einzeln über das Augensymbol). Jetzt muss man nur noch jedem Miglied seine Daten (Gruppenname, Name, Schlüssel) zukommen lassen und jeder kann starten für sich einen Partner zu ziehen. Mit einem Klick auf 'Fertig' werden die Daten dann geschlossen.",
    "drawmember": "Partner ziehen",
    "drawmember-content": "Beim Partner ziehen sind die Zugangsdaten einzugeben, welche jedes Mitglied beim Erstellen einer Gruppe zugewiesen wurden. Sind die Zugangsdaten korrekt eingegeben wird mit einem Klick auf 'Weiter' dem Miglied ein Partner aus der Gruppe zugewiesen und dessen Name angezeigt. Wurde beim Erstellen der Gruppe die Option von Neuwahlen gegeben, kann mit einem Klick auf 'Erneut ziehen' erneut ein Partner gezogen und zugewiesen werden. Achtung hier kann auch der selbe Partner erneut gezogen werden. Es kann so lange neu gezogen werden wie es bei der Erstellung der Gruppe angegeben wurde. Wie viele Züge noch übrig sind kann der kleinen Zahl rechts über der Schaltfläche entnommen werden. Wurde ein passender Partner gezogen, so kann man diesen Partner durch einen Klick auf 'Akzeptieren' bestätigen. Nach 5 Minuten wird der gezogene Partner automatisch für einen akzeptiert. Ist der Partner akzeptiert kann nicht neu gezogen werden. Hat man seinen Partner vergessen kann man jederzeit seine Zugangsdaten erneut eingeben und bekommt seinen zugewiesenen Partner erneut angezeigt."
  }
}